#include <string>
#include "config.hpp"
namespace init
{
    std::string help_doc = R"(
GHCD 帮助文档
由 Vingturbo 编写

GHCD( GayHub Cloud Disk ), 是使用 GitHub Releases 文件存储功能来作为网络存储的工具, 下文将重点介绍它 CLI 方面的使用说明, 如果你使用单纯的 `--desktop` 或 `--web`, 则会相应启动桌面客户端或 web 服务器

ghcd [[开关...] [参数...]...]

其中, 开关支持使用类似于 `-h`, `--help`, `-Ido`, `-I --download -o` 这种十分灵活的格式
注意: 开关是大小写严格的, 且分为 "开关类", "主开关", "修饰开关", "特殊开关" 这几类

对于单个或单组开关的定义是以 `-` 或 `--` 开始的, 由拉丁字母和 `-` 构成的连续字符或字符串
对于单个参数的定义是以 `@` 开头的, 且在命令语义中保持整体完整的字符串
你可以使用以下开关:
    开关类, 均无需参数:
        -I, --internet               互联网相关的开关类
        -L, --local                  本地的操作
        -C, --config                 管理长久保存的本地配置
        -S, --share                  用于文件分享的开关分类
        -P, --place                  管理多个预设
        -O, --other                  不在上述开关类所包含之类的开关
    主开关, 未标注则无需参数:
        -V, --version                显示版本
        -u, --upload                 用于上传文件, 需要文件路径参数
        -d, --download               用于下载文件, 需要文件名称参数
        -s, --search                 用于在包含多组由程序管理的数据中按照预定的方式查找用户指定的数据, 需要搜索字段参数
        -v, --view                   用于查看某些由程序保存的数据, 需要对象名称参数
        -c, --create                 用于创建程序支持的某些对象或是数据, 需要对象名称参数
        -f, --fetch                  获取一些设计上无法直接查看的数据, 需要对象参数
        -h, --help                   查看此帮助文档
        -m, --my-config-set          用于设置仅应用于该预设的配置选项, 需要符合KSV格式的单行单配置参数
        -g, --global-config-set      用于设置应用于该用户的全局配置选项, 需要符合KSV格式的单行单配置参数
        -r, --restore                用于从程序制造的加密文件中还原文件, 需要文件路径参数
        -a, --add                    添加对象, 需要对象参数
        -w, --use                    使用对象, 需要对象参数
        -x, --remove                 移除对象, 需要对象参数
    修饰开关:
        -o, --out                    设置文件输出路径, 需要文件路径参数
        -p, --password               设置文件加密用户密码
        -n, --name                   设置文件名称, 需要名称参数
        -k, --key                    明确指示文件加密密钥K, 需要一个 64 字节, HEX 编码的 256bit 密钥
        -t, --timestamp              明确指示文件在记录中的时间戳, 需要一个以毫秒为单位的整型 UNIX 时间戳
        -b, --base64                 指示程序使用 base64 编码而不是二进制的方式处理和制造文件, 无需参数
        --debug                      开启调试模式
        --complete                   指示程序以完成指定任务为最高目标
    特殊开关:
        -i, --include-online-config  从 http(s), file, data:URL 协议加载文件, 将其作为标准 KSV 文件处理, 需要一个符合标准的 URL 参数
        -j, --jump-config            临时更改一条运行时配置, 需要一个 KSV 格式的单行单配置参数

关于开关之间的兼容, 依赖, 排斥关系, 请查看源代码详细了解
注意: 开关间没有强制的顺序规定, 但我们还是建议您将开关按照 "开关类", "主开关", "修饰开关", "特殊开关" 的方式排序, 原因无他, 如果不这么做, 您可能会被某些脾气暴躁的人打死, 当然, 可能他们打您的原因不是这个……

关于参数, 每条参数都必须也只能以 `@` 开头, 这包括 KSV 格式配置文件中的值部分
参数可以以以下几种开头来表示不同的意思和处理方式

    `@@` 表示参数去掉前导符号后的字面量
    `@_` 表示后面的部分将在每次需要时作为系统命令执行, 并且获取返回值作为参数值
    `@!` 表示后面的部分会在获取参数后作为系统命令执行一次, 然后获取返回值并且缓存, 每次需要时作为常量读取

当然, 这种参数格式是十分不同的, 但是他的逻辑清晰, 且功能强大, 便于使用

关于开关和参数之间的对应关系, 并不是像普通的逻辑一样, 一个开关后面所跟随的参数就是这个开关的参数
而是遵从序列上的一一对应关系, 即
开关和参数的相对位置不决定参数归属
但是开关和开关间的相对位置与参数和参数间的相对位置决定参数归属
示例：
    ghcd -Ido '@@example_file' '@@~/Download/'
        -d --> '@@example_file'
        -o --> '@@~/Download/'

    ghcd -dpoI '@@file1' '@@123456' '@@./' -i '@@https://example.com/test.ksv'
        -d --> '@@file1'
        -p --> '@@123456'
        -o --> '@@./'
        -i --> '@@https://example.com/test.ksv'
好, 非常好理解吧, 参数与开关就是如此简单
注意: 像上面一样, 您最好不要采取示例中这种为了说明而采取的风格, 我们更加建议你像正常的CLI那样来表示开关和参数的关系

您可以在 GitHub 上或者向 <vingturbo@qq.com> 报告软件错误或者兼容性问题
Copyright © 2026 Vingturbo
SPDX-License-Identifier: AGPL-3.0-or-later
本软件是自由软件：您可以自由修改和重新发布它。
在法律允许的范围内, 不提供任何保证。
)";
}